IDENTIFICATION DIVISION.
PROGRAM-ID. MANAJEMEN-DONASI.
AUTHOR. Nama Penulis.
DATE-WRITTEN. Tanggal Pembuatan Program.

* DEKLARASI FILE
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DONASI-FILE ASSIGN TO "donasi.dat"
        ORGANIZATION IS LINE SEQUENTIAL.

* DEKLARASI VARIABEL
DATA DIVISION.
FILE SECTION.
FD DONASI-FILE.
01 DONASI-RECORD.
   02 NAMA-PENDONAT   PIC X(30).
   02 JUMLAH-DONASI   PIC 9(10).
   02 TANGGAL-DONASI  PIC X(8).
   02 WAKTU-DONASI    PIC X(8).

WORKING-STORAGE SECTION.
01 PILIHAN          PIC X.
01 JML-DONASI-IN    PIC 9(10).
01 TOTAL-DONASI     PIC 9(10).
01 SELESAI          PIC X VALUE 'N'.

* PROGRAM UTAMA
PROCEDURE DIVISION.
MAIN-PROGRAM.
    DISPLAY "SELAMAT DATANG DI PROGRAM MANAJEMEN DONASI".
    PERFORM UBAH-DONASI UNTIL SELESAI = 'Y'.
    DISPLAY "TERIMA KASIH TELAH MENGGUNAKAN PROGRAM KAMI".
    STOP RUN.

* PERUBAHAN DONASI
UBAH-DONASI.
    DISPLAY "---------------------------------------------------".
    DISPLAY "MASUKKAN PILIHAN ANDA :".
    DISPLAY "1. INPUT DONASI".
    DISPLAY "2. CEK TOTAL DONASI".
    DISPLAY "3. KELUAR".

    ACCEPT PILIHAN.

    PERFORM MENU-ACTION THRU EXIT-MENU-ACTION.

EXIT-MENU-ACTION.
    DISPLAY "---------------------------------------------------".

* PILIHAN MENU
MENU-ACTION.
    IF PILIHAN = '1' THEN
        PERFORM INPUT-DONASI
    ELSE IF PILIHAN = '2' THEN
        PERFORM CEK-TOTAL-DONASI
    ELSE IF PILIHAN = '3' THEN
        MOVE 'Y' TO SELESAI
    ELSE
        DISPLAY "PILIHAN SALAH. SILAKAN COBA LAGI.".

* INPUT DONASI BARU
INPUT-DONASI.
    DISPLAY "---------------------------------------------------".
    DISPLAY "MASUKKAN NAMA PENDONAT :".
    ACCEPT NAMA-PENDONAT.

    DISPLAY "MASUKKAN JUMLAH DONASI :".
    ACCEPT JML-DONASI-IN.
    COMPUTE JUMLAH-DONASI = JUMLAH-DONASI + JML-DONASI-IN.

    ACCEPT TANGGAL-DONASI FROM DATE YYYYMMDD.
    ACCEPT WAKTU-DONASI FROM TIME.

    WRITE DONASI-RECORD
        FROM NAMA-PENDONAT
             JUMLAH-DONASI
             TANGGAL-DONASI
             WAKTU-DONASI.

    DISPLAY "DONASI BERHASIL DISIMPAN".

* CEK TOTAL DONASI
CEK-TOTAL-DONASI.
    DISPLAY "---------------------------------------------------".
    DISPLAY "TOTAL DONASI SAAT INI ADALAH : " JUMLAH-DONASI.

    MOVE 0 TO TOTAL-DONASI.

PERFORM UNTIL END-OF-DONASI-FILE
    READ DONASI-FILE
        AT END SET END-OF-DONASI-FILE TO TRUE
        NOT AT END
            ADD JUMLAH-DONASI TO TOTAL-DONASI
    END-READ
END-PERFORM

IF END-OF-DONASI-FILE
    DISPLAY "TIDAK ADA DONASI YANG DITEMUKAN"
ELSE
    DISPLAY "TOTAL DONASI DI FILE ADALAH : " TOTAL-DONASI
END-IF

CLOSE DONASI-FILE.
